Изменения типовой конфигурации/src/Catalogs/Изм_Коммиты/Изм_Коммиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Изм_Коммиты</name>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСвязьСТехПроектами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Файлы</name>
    <attributes>
      <name>ПутьКФайлу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Распознан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзмененныеМетаданные</name>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовРасширений</types>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехническиеПроекты</name>
    <attributes>
      <name>ТехническийПроект</name>
      <type>
        <types>CatalogRef.Изм_ТехническиеПроекты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Изменения типовой конфигурации/src/Catalogs/Изм_Коммиты/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	ОтразитьМетаданныеВПодсистемах();
КонецПроцедуры


Процедура ОтразитьМетаданныеВПодсистемах()
	Для каждого СтрокаТехПроекта Из ТехническиеПроекты Цикл
		СпрПроект = СтрокаТехПроекта.ТехническийПроект.ПолучитьОбъект();
		Для каждого СтрокаМетаданных  Из ИзмененныеМетаданные Цикл
			Отбор = Новый Структура("ОбъектМетаданных", СтрокаМетаданных.ОбъектМетаданных);
			НайденныеСтроки = СпрПроект.ИзмененныеМетаданные.НайтиСтроки(Отбор);	
			Если НайденныеСтроки.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = СпрПроект.ИзмененныеМетаданные.Добавить();
			НоваяСтрока.ОбъектМетаданных = СтрокаМетаданных.ОбъектМетаданных;
		КонецЦикла;
		СпрПроект.Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	ЕстьСвязьСТехПроектами = ТехническиеПроекты.Количество() > 0;
КонецПроцедуры
